using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace EnigmaLib
{
    public static class Languages
    {
        public static Dictionary<char, char> EnRDict = new Dictionary<char, char>()
        {
            {'a', 'z'}, {'b', 'y'}, {'c', 'x'}, {'d', 'w'}, {'e', 'v'},
            {'f', 'u'}, {'g', 't'}, {'h', 's'}, {'i', 'r'}, {'j', 'q'},
            {'k', 'p'}, {'l', 'o'}, {'m', 'n'}, {'n', 'm'}, {'o', 'l'},
            {'p', 'k'}, {'q', 'j'}, {'r', 'i'}, {'s', 'h'}, {'t', 'g'},
            {'u', 'f'}, {'v', 'e'}, {'w', 'd'}, {'x', 'c'}, {'y', 'b'},
            {'z', 'a'},
        };

        public static Dictionary<char, char> RuRDict = new Dictionary<char, char>()
        {
            {'а', '-'}, {'б', 'э'}, {'в', 'ь'}, {'г', 'г'}, {'д', 'ы'},
            {'ё', 'щ'}, {'ж', 'ш'}, {'з', 'ч'}, {'и', 'ц'}, {'й', 'х'},
            {'к', 'у'}, {'л', 'т'}, {'м', 'с'}, {'н', 'р'}, {'о', 'п'},
            {'п', 'о'}, {'р', 'н'}, {'с', 'м'}, {'т', 'л'}, {'у', 'к'},
            {'х', 'й'}, {'ц', 'и'}, {'ч', 'з'}, {'ш', 'ж'}, {'щ', 'ё'},
            {'ъ', 'е'}, {'ы', 'д'}, {'ь', 'в'}, {'э', 'б'}, {'я', ':'},
            {' ', '.'}, {'.', ' '}, {'!', '?'}, {'?', '!'}, {',', '"'},
            {'"', ','}, {'-', 'а'}, {':', 'я'}, {'е', 'ъ'}
        };

        public static Dictionary<char, char> EnRDictStd = new Dictionary<char, char>()
        {
            {'a', 'a'}, {'b', 'b'}, {'c', 'c'}, {'d', 'd'}, {'e', 'e'},
            {'f', 'f'}, {'g', 'g'}, {'h', 'h'}, {'i', 'i'}, {'j', 'j'},
            {'k', 'k'}, {'l', 'l'}, {'m', 'm'}, {'n', 'n'}, {'o', 'o'},
            {'p', 'p'}, {'q', 'q'}, {'r', 'r'}, {'s', 's'}, {'t', 't'},
            {'u', 'u'}, {'v', 'v'}, {'w', 'w'}, {'x', 'x'}, {'y', 'y'},
            {'z', 'z'}
        };

        public static Dictionary<char, char> RuRDictStd = new Dictionary<char, char>()
        {
            {'а', 'а'}, {'б', 'б'}, {'в', 'в'}, {'г', 'г'}, {'д', 'д'},
            {'ё', 'ё'}, {'ж', 'ж'}, {'з', 'з'}, {'и', 'и'}, {'й', 'й'},
            {'к', 'к'}, {'л', 'л'}, {'м', 'м'}, {'н', 'н'}, {'о', 'о'},
            {'п', 'п'}, {'р', 'р'}, {'с', 'с'}, {'т', 'т'}, {'у', 'у'},
            {'х', 'х'}, {'ц', 'ц'}, {'ч', 'ч'}, {'ш', 'ш'}, {'щ', 'щ'},
            {'ъ', 'ъ'}, {'ы', 'ы'}, {'ь', 'ь'}, {'э', 'э'}, {'ю', 'ю'},
            {'я', 'я'}
        };

        public static Dictionary<char, char> EnRDictRef = new Dictionary<char, char>()
        {
            {'a', 'v'}, {'b', 'm'}, {'c', 'w'}, {'d', 's'}, {'e', 'i'},
            {'f', 'n'}, {'g', 'y'}, {'h', 'q'}, {'i', 'e'}, {'j', 'o'},
            {'k', 'u'}, {'l', 'z'}, {'m', 'b'}, {'n', 'f'}, {'o', 'j'},
            {'p', 'x'}, {'q', 'h'}, {'r', 't'}, {'s', 'd'}, {'t', 'r'},
            {'u', 'k'}, {'v', 'a'}, {'w', 'c'}, {'x', 'p'}, {'y', 'g'},
            {'z', 'l'}
        };

        public static Dictionary<char, char> RuRDictRef = new Dictionary<char, char>()
        {
            {'а', 'б'}, {'б', 'а'}, {'в', 'м'}, {'г', 'ц'}, {'д', 'д'},
            {'ё', 'ё'}, {'ж', '-'}, {'з', 'э'}, {'и', 'и'}, {'й', 'р'},
            {'к', 'к'}, {'л', 'л'}, {'м', 'в'}, {'н', 'т'}, {'о', 'у'},
            {'п', 'е'}, {'р', 'й'}, {'с', 'с'}, {'т', 'н'}, {'у', 'о'},
            {'х', 'ч'}, {'ц', 'г'}, {'ч', 'х'}, {'ш', 'ш'}, {'щ', 'щ'},
            {'ъ', 'ь'}, {'ы', 'ы'}, {'ь', 'ъ'}, {'э', 'з'}, {'я', '?'},
            {' ', '"'}, {'.', '.'}, {'!', 'ю'}, {'?', 'я'}, {',', ':'},
            {'"', ' '}, {'-', 'ж'}, {':', ','}, {'ю', '!'}, {'е', 'п'}
        };

        public static char RuSTDKey = 'а';

        public static char EnSTDKey = 'a';
    }
}
